app/controllers/articles_controller.rb

INSERT INTO "articles" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "asdasd"], ["user_id", 4], ["created_at", "2020-02-03 11:22:22.297864"], ["updated_at", "2020-02-03 11:22:22.297864"]]
---
  def create
    @article = current_user.articles.build(article_params)

    respond_to do |format|
      if @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_article
      @article = Article.where(params[:id]).take